app/controllers/rooms_controller.rb

  def show
    @single_room = Room.find(params[:id])

    @room = Room.new
    @rooms = Room.public_rooms

    @message = Message.new

    pagy_messages = @single_room.messages.order(created_at: :desc)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ? ORDER BY "messages"."created_at" ASC  [["room_id", 4]]

  def create
    @room = Room.create(name: params['room']['name'])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "hey"], ["is_private", false], ["created_at", "2022-06-14 17:53:26.498169"], ["updated_at", "2022-06-14 17:53:26.498169"]]

  def set_status
    current_user.update!(status: User.statuses[:online]) if current_user
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-06-18 16:31:30.365362"], ["status", 2], ["id", 1]]