app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @users = User.all_except(current_user)

    @room = Room.new
    @rooms = Room.public_rooms
    @room_name = get_name(@user, current_user)
    @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, current_user], @room_name)

    @message = Message.new

    pagy_messages = @single_room.messages.order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2022-06-14 17:54:57.054912"], ["updated_at", "2022-06-14 17:54:57.054912"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["name", "private_1_2"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1 ORDER BY "messages"."created_at" DESC LIMIT $2 OFFSET $3  [["room_id", 3], ["LIMIT", 20], ["OFFSET", 0]]