app/models/room.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2022-06-14 17:54:57.054912"], ["updated_at", "2022-06-14 17:54:57.054912"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["room_id", 2], ["created_at", "2022-06-14 17:54:57.087693"], ["updated_at", "2022-06-14 17:54:57.087693"]]
---
  def self.create_private_room(users, room_name)
    single_room = Room.create(name: room_name, is_private: true)
    users.each do |user|
      Participant.create(user_id: user.id, room_id: single_room.id)

SELECT 1 AS one FROM "participants" WHERE "participants"."room_id" = $1 AND "participants"."user_id" = $2 LIMIT $3  [["room_id", 3], ["user_id", 2], ["LIMIT", 1]]
---
  def participants?(room, user)
    room.participants.where(user: user).exists?